Tekla Open API Reference for Tekla Structures 2025
Size Class
 The Size class contains the width and height properties.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.Size
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class Size
<SerializableAttribute>
Public Class Size
The Size type exposes the following members.
Constructors
Name | Description
Size()
 Creates a new size instance with zero width and height.
Size(Double, Double)
 Creates a new size instance with the specified width and height.
Top
Properties
Name | Description
Height
 Gets or sets the height value of the size instance.
Width
 Gets or sets the width value of the size instance.
Top
Methods
Name | Description
ToString()
 Returns a string that represents this instance (in fractional inches if advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES set to true).
 (Overrides Object.ToString().)
ToString(String)
 Returns a string that represents this instance (in fractional inches if advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES set to true).
ToString(IFormatProvider, String)
 Returns a string that represents this instance (in fractional inches if advanced option XS_USE_ONLY_INCHES_IN_SHEET_SIZES set to true).
Top
See Also
Reference
Tekla.Structures.Drawing Namespace